Pandas Dataframe

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df = pd.read_csv('PandasExample.csv')

In [16]:
df

            Nama  Age   Gender
0     Satrio Adi    22    Male
1     Ari Irawan    24    Male
2  Bangkit Galuh    23  Female
3      Nazarudin    22    Male
4       Fifi Dwi    22  Female
5          Dakri    22    Male

In [18]:
df.head()

            Nama  Age   Gender
0     Satrio Adi    22    Male
1     Ari Irawan    24    Male
2  Bangkit Galuh    23  Female
3      Nazarudin    22    Male
4       Fifi Dwi    22  Female

In [19]:
df.tail()

            Nama  Age   Gender
1     Ari Irawan    24    Male
2  Bangkit Galuh    23  Female
3      Nazarudin    22    Male
4       Fifi Dwi    22  Female
5          Dakri    22    Male

In [20]:
df.head(2)

         Nama  Age  Gender
0  Satrio Adi    22   Male
1  Ari Irawan    24   Male

In [21]:
df.tail(2)

       Nama  Age   Gender
4  Fifi Dwi    22  Female
5     Dakri    22    Male

In [23]:
df.iloc[0]

Nama      Satrio Adi
Age               22
Gender          Male
Name: 0, dtype: object

In [24]:
df.iloc[2]

Nama      Bangkit Galuh
Age                  23
Gender           Female
Name: 2, dtype: object

In [25]:
df.values

array([['Satrio Adi', 22, 'Male'],
       ['Ari Irawan', 24, 'Male'],
       ['Bangkit Galuh', 23, 'Female'],
       ['Nazarudin', 22, 'Male'],
       ['Fifi Dwi', 22, 'Female'],
       ['Dakri', 22, 'Male']], dtype=object)

In [26]:
df = pd.read_csv('PandasExample.csv',chunksize=3)

In [27]:
for chunk in df:
    print(chunk)

            Nama  Age   Gender
0     Satrio Adi    22    Male
1     Ari Irawan    24    Male
2  Bangkit Galuh    23  Female
        Nama  Age   Gender
3  Nazarudin    22    Male
4   Fifi Dwi    22  Female
5      Dakri    22    Male

In [28]:
df = pd.read_csv('PandasExample.csv')